<!DOCTYPE html>
<html>
    
    <head>
       
    </head>
    
<body>

<!-- 6. Напишете вложени цикли, които извеждат таблицата от прикачения файл table.png (в края на условието) -->

<table border = "1px" align="center" cellspacing="0">   
<?php for($i = 1; $i <= 10; $i++): ?>     <!-- Създаваме цикъл, който да извежда числата от едно до 10 -->
    <tr>  
    <?php for($j = 1; $j <= 10; $j++): ?>   <!-- Създаваме вложен цикъл, който да извежда числата от едно до 10 -->
      <td>
       <?php echo $i * $j; ?>    <!-- Умножаваме числата от двата цикъла във таблицата създадена с html-->
      </td>
    <?php endfor ?>
    </tr>
<?php endfor ?>
</table>

</body>
</html>
