<?php

//2. Напишете php програмка, която извежда сумата на числата от 0 до 30. 
//        Използвайте for цикъл и си припомнете математическите оператори

$result = 0; // създаваме променлива, която приема стойност 0, която ще използваме за да пресметнем сумата от числата в цикъла
for($i = 0; $i <= 30; $i++){ // създаваме цикъл за извеждане на числата от 0 до 30
   
    $result = $result + $i; //  при всяка итерация променливата приема нова стойност, като се събира със всяко изведено число
}
 echo $result; // извеждаме резултата
 