<?php

//7. Напишете цикли, които извеждат "триъгълници на Флойд" с 5, 10 и 21 реда. Накратко казано, 
//   това са ляво подравнени правоъгълни триъгълници от редове с цели числа, 
//   където всеки ред започва с поредното число и съдържа с едно число повече от предния ред.


$number1 = 1;  // създаваме променливи, за да може да изведем числата на екрана
$number2 = 1;
$number3 = 1; 

// Триъгълник на ФЛойд с 5 реда:
for($i = 0; $i <= 5; $i++){ // цикъл определящ броя на редовете
    for ($j = 0; $j < $i; $j++){  // определяме броя на колоните и задаваме j < i за да ограничим сомвилите на реда.
               
    echo $number1++ . ' ';  // при изпълняване на цикъла числото се увеличава с едно при всяка итерация и резултатите се изобразяват на екрана
  }
  echo '<br/>'; // след изпълнението на първия for пренасяме на нов ред, за да не се изобразяват символите само на 1 ред
}
echo '<br>';
echo '<br>';


// Триъгълник на ФЛойд с 10 реда:
for($i = 0; $i <= 10; $i++){ // цикъл определящ броя на редовете
    for ($j = 0; $j < $i; $j++){  // определяме броя на колоните и задаваме j < i за да ограничим сомвилите на реда.
               // 
    echo $number2++ . ' ';  // при изпълняване на цикъла числото се увеличава с едно при всяка итерация и резултатите се изобразяват на екрана
  }
  echo '<br/>'; // след изпълнението на първия for пренасяме на нов ред, за да не се изобразяват символите само на 1 ред
}
echo '<br>';
echo '<br>';


// Триъгълник на ФЛойд с 21 реда:
for($i = 0; $i <= 21; $i++){ // цикъл определящ броя на редовете
    for ($j = 0; $j < $i; $j++){  // определяме броя на колоните и задаваме j < i за да ограничим сомвилите на реда.
            
    echo $number3++ . ' ';  // при изпълняване на цикъла числото се увеличава с едно при всяка итерация и резултатите се изобразяват на екрана
  }
  echo '<br/>'; // след изпълнението на първия for пренасяме на нов ред, за да не се изобразяват символите само на 1 ред
}
echo '<br>';
echo '<br>';
